#include <stdio.h>
int e[9][9];
int vis[9];

void dfs(int u) {
    // 标记为已访问
    printf("%d ", u);
    vis[u] = 1;
    // 遍历所有顶点
    for (int v = 0; v < 9; v++) { 
        // 如果有边且未访问
        if (e[u][v] && !vis[v])  
            dfs(v);
    }
}

int main() {
    e[0][1] = e[1][0] = 1;
    e[0][2] = e[2][0] = 1;
    e[1][3] = e[3][1] = 1;
    e[1][4] = e[4][1] = 1;
    e[1][8] = e[8][1] = 1;
    e[2][5] = e[5][2] = 1;
    e[2][7] = e[7][2] = 1;
    e[3][6] = e[6][3] = 1;
    e[5][7] = e[7][5] = 1;
    e[6][8] = e[8][6] = 1;

    // 从 0 开始遍历
    dfs(0);
    return 0;
}